RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_gpio.h
/**
 *******************************************************************************
 * @file  hc32f4a0_gpio.h
 * @brief This file contains all the functions prototypes of the GPIO driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Zhangxl         First version
   2020-09-21       Zhangxl         Typo, missing FUNC_I2C3 defintion
   2020-10-27       Zhangxl         Revise debug port definition
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32F4A0_GPIO_H__
#define __HC32F4A0_GPIO_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_GPIO
 * @{
 */

#if (DDL_GPIO_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup GPIO_Global_Types GPIO Global Types
 * @{
 */

/**
 * @brief  GPIO Pin Set and Reset enumeration
 */
typedef enum
{
    Pin_Reset = 0U,           /*!< Pin reset    */
    Pin_Set   = 1U            /*!< Pin set      */
} en_pin_state_t;

/**
 * @brief  GPIO Init structure definition
 */
typedef struct
{
    uint16_t u16PinState;     /*!< Set pin state to High or Low, @ref GPIO_PinState_Sel for details       */
    uint16_t u16PinDir;       /*!< Pin mode setting, @ref GPIO_PinDirection_Sel for details               */
    uint16_t u16PinOType;     /*!< Output type setting, @ref GPIO_PinOutType_Sel for details              */
    uint16_t u16PinDrv;       /*!< Pin drive capacity setting, @ref GPIO_PinDrv_Sel for details           */
    uint16_t u16Latch;        /*!< Pin latch setting, @ref GPIO_PinLatch_Sel for details                  */
    uint16_t u16PullUp;       /*!< Internal pull-up resistor setting, @ref GPIO_PinPU_Sel for details     */
    uint16_t u16Invert;       /*!< Pin input/output invert setting, @ref GPIO_PinInvert_Sel               */
    uint16_t u16PinIType;     /*!< Input type setting, @ref GPIO_PinInType_Sel                            */
    uint16_t u16ExInt;        /*!< External interrupt pin setting, @ref GPIO_PinExInt_Sel for details     */
    uint16_t u16PinAttr;      /*!< Digital or analog attribute setting, @ref GPIO_PinMode_Sel for details */
} stc_gpio_init_t;
/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup GPIO_Global_Macros GPIO Global Macros
 * @{
 */

/** @defgroup GPIO_pins_define GPIO pin source
 * @{
 */
#define GPIO_PIN_00                 (0x0001U)  /*!< Pin 00 selected   */
#define GPIO_PIN_01                 (0x0002U)  /*!< Pin 01 selected   */
#define GPIO_PIN_02                 (0x0004U)  /*!< Pin 02 selected   */
#define GPIO_PIN_03                 (0x0008U)  /*!< Pin 03 selected   */
#define GPIO_PIN_04                 (0x0010U)  /*!< Pin 04 selected   */
#define GPIO_PIN_05                 (0x0020U)  /*!< Pin 05 selected   */
#define GPIO_PIN_06                 (0x0040U)  /*!< Pin 06 selected   */
#define GPIO_PIN_07                 (0x0080U)  /*!< Pin 07 selected   */
#define GPIO_PIN_08                 (0x0100U)  /*!< Pin 08 selected   */
#define GPIO_PIN_09                 (0x0200U)  /*!< Pin 09 selected   */
#define GPIO_PIN_10                 (0x0400U)  /*!< Pin 10 selected   */
#define GPIO_PIN_11                 (0x0800U)  /*!< Pin 11 selected   */
#define GPIO_PIN_12                 (0x1000U)  /*!< Pin 12 selected   */
#define GPIO_PIN_13                 (0x2000U)  /*!< Pin 13 selected   */
#define GPIO_PIN_14                 (0x4000U)  /*!< Pin 14 selected   */
#define GPIO_PIN_15                 (0x8000U)  /*!< Pin 15 selected   */
#define GPIO_PIN_ALL                (0xFFFFU)  /*!< All pins selected */

#define GPIO_PIN_MASK               (0xFFFFU)  /*!< PIN mask for assert test */

/**
 * @}
 */

/** @defgroup GPIO_Port_source GPIO port source
  * @{
  */
#define GPIO_PORT_A                 (0x00U)  /*!< Port A selected  */
#define GPIO_PORT_B                 (0x01U)  /*!< Port B selected  */
#define GPIO_PORT_C                 (0x02U)  /*!< Port C selected  */
#define GPIO_PORT_D                 (0x03U)  /*!< Port D selected  */
#define GPIO_PORT_E                 (0x04U)  /*!< Port E selected  */
#define GPIO_PORT_F                 (0x05U)  /*!< Port F selected  */
#define GPIO_PORT_G                 (0x06U)  /*!< Port G selected  */
#define GPIO_PORT_H                 (0x07U)  /*!< Port H selected  */
#define GPIO_PORT_I                 (0x08U)  /*!< Port I selected  */
/**
 * @}
 */

/** @defgroup GPIO_Port_index GPIO port index
 * @{
 */
#define GPIO_PORTA_IDX              (0x0001U)
#define GPIO_PORTB_IDX              (0x0002U)
#define GPIO_PORTC_IDX              (0x0004U)
#define GPIO_PORTD_IDX              (0x0008U)
#define GPIO_PORTE_IDX              (0x0010U)
#define GPIO_PORTF_IDX              (0x0020U)
#define GPIO_PORTG_IDX              (0x0040U)
#define GPIO_PORTH_IDX              (0x0080U)
#define GPIO_PORTI_IDX              (0x0100U)
#define GPIO_PORT_ALL               (0x01FFU)

#define GPIO_PORT_MASK              (0x01FFU)
/**
 * @}
 */

/**
 * @}
 */

/** @defgroup GPIO_function_selection_define GPIO function selection
 * @{
 */
/** @defgroup GPIO_PinFunction0 GPIO Function 0 selection
 * @{
 */
#define GPIO_FUNC_0                 (0x00U)
#define GPIO_FUNC_0_GPO             (GPIO_FUNC_0)     /* GPO function */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction1 GPIO Function 1 selection
 * @{
 */
#define GPIO_FUNC_1                 (0x01U)
#define GPIO_FUNC_1_FCMREF          (GPIO_FUNC_1)   /*!< Reference clock input for FCM */
#define GPIO_FUNC_1_CTCREF          (GPIO_FUNC_1)   /*!< Reference clock input for internal CTC */
#define GPIO_FUNC_1_RTCOUT          (GPIO_FUNC_1)   /*!< RTC 1Hz output */
#define GPIO_FUNC_1_VCOUT           (GPIO_FUNC_1)   /*!< Voltage comparator output */
#define GPIO_FUNC_1_ADTRG           (GPIO_FUNC_1)   /*!< ADC external trigger */
#define GPIO_FUNC_1_MCO             (GPIO_FUNC_1)   /*!< Clock output */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction2 GPIO Function 2 selection
 * @{
 */
#define GPIO_FUNC_2                 (0x02U)
#define GPIO_FUNC_2_TIM41           (GPIO_FUNC_2)   /*!< TMR4 unit */
#define GPIO_FUNC_2_TIM41_PCT       (GPIO_FUNC_2)   /*!< TMR4 unit 1 basetimer count direction indicator */
#define GPIO_FUNC_2_TIM41_ADSM      (GPIO_FUNC_2)   /*!< TMR4 unit 1 special event */
#define GPIO_FUNC_2_TIM41_CLK       (GPIO_FUNC_2)   /*!< TMR4 unit 1 clock input */
#define GPIO_FUNC_2_TIM41_OUH       (GPIO_FUNC_2)   /*!< TMR4 unit 1 U-phase output high */
#define GPIO_FUNC_2_TIM41_OUL       (GPIO_FUNC_2)   /*!< TMR4 unit 1 U-phase output low */
#define GPIO_FUNC_2_TIM41_OVH       (GPIO_FUNC_2)   /*!< TMR4 unit 1 V-phase output high */
#define GPIO_FUNC_2_TIM41_OVL       (GPIO_FUNC_2)   /*!< TMR4 unit 1 V-phase output low */
#define GPIO_FUNC_2_TIM41_OWH       (GPIO_FUNC_2)   /*!< TMR4 unit 1 W-phase output high */
#define GPIO_FUNC_2_TIM41_OWL       (GPIO_FUNC_2)   /*!< TMR4 unit 1 W-phase output low */

#define GPIO_FUNC_2_TIM42           (GPIO_FUNC_2)   /*!< TMR4 unit */
#define GPIO_FUNC_2_TIM42_PCT       (GPIO_FUNC_2)   /*!< TMR4 unit 2 basetimer count direction indicator */
#define GPIO_FUNC_2_TIM42_ADSM      (GPIO_FUNC_2)   /*!< TMR4 unit 2 special event */
#define GPIO_FUNC_2_TIM42_CLK       (GPIO_FUNC_2)   /*!< TMR4 unit 2 clock input */
#define GPIO_FUNC_2_TIM42_OUH       (GPIO_FUNC_2)   /*!< TMR4 unit 2 U-phase output high */
#define GPIO_FUNC_2_TIM42_OUL       (GPIO_FUNC_2)   /*!< TMR4 unit 2 U-phase output low */
#define GPIO_FUNC_2_TIM42_OVH       (GPIO_FUNC_2)   /*!< TMR4 unit 2 V-phase output high */
#define GPIO_FUNC_2_TIM42_OVL       (GPIO_FUNC_2)   /*!< TMR4 unit 2 V-phase output low */
#define GPIO_FUNC_2_TIM42_OWH       (GPIO_FUNC_2)   /*!< TMR4 unit 2 W-phase output high */
#define GPIO_FUNC_2_TIM42_OWL       (GPIO_FUNC_2)   /*!< TMR4 unit 2 W-phase output low */

#define GPIO_FUNC_2_TIM43           (GPIO_FUNC_2)   /*!< TMR4 unit */
#define GPIO_FUNC_2_TIM43_PCT       (GPIO_FUNC_2)   /*!< TMR4 unit 3 basetimer count direction indicator */
#define GPIO_FUNC_2_TIM43_ADSM      (GPIO_FUNC_2)   /*!< TMR4 unit 3 special event */
#define GPIO_FUNC_2_TIM43_CLK       (GPIO_FUNC_2)   /*!< TMR4 unit 3 clock input */
#define GPIO_FUNC_2_TIM43_OUH       (GPIO_FUNC_2)   /*!< TMR4 unit 3 U-phase output high */
#define GPIO_FUNC_2_TIM43_OUL       (GPIO_FUNC_2)   /*!< TMR4 unit 3 U-phase output low */
#define GPIO_FUNC_2_TIM43_OVH       (GPIO_FUNC_2)   /*!< TMR4 unit 3 V-phase output high */
#define GPIO_FUNC_2_TIM43_OVL       (GPIO_FUNC_2)   /*!< TMR4 unit 3 V-phase output low */
#define GPIO_FUNC_2_TIM43_OWH       (GPIO_FUNC_2)   /*!< TMR4 unit 3 W-phase output high */
#define GPIO_FUNC_2_TIM43_OWL       (GPIO_FUNC_2)   /*!< TMR4 unit 3 W-phase output low */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction3 GPIO Function 3 selection
 * @{
 */
#define GPIO_FUNC_3                 (0x03U)
#define GPIO_FUNC_3_TIM6_TRIG       (GPIO_FUNC_3)   /*!< TMR6 trigger */
#define GPIO_FUNC_3_TIM6_TRIGA      (GPIO_FUNC_3)   /*!< TMR6 trigger A */
#define GPIO_FUNC_3_TIM6_TRIGB      (GPIO_FUNC_3)   /*!< TMR6 trigger B */
#define GPIO_FUNC_3_TIM6_TRIGC      (GPIO_FUNC_3)   /*!< TMR6 trigger C */
#define GPIO_FUNC_3_TIM6_TRIGD      (GPIO_FUNC_3)   /*!< TMR6 trigger D */

#define GPIO_FUNC_3_TIM61           (GPIO_FUNC_3)   /*!< TMR6 unit 1 */
#define GPIO_FUNC_3_TIM61_PWMA      (GPIO_FUNC_3)   /*!< TMR6 unit 1 channel A PWM output */
#define GPIO_FUNC_3_TIM61_PWMB      (GPIO_FUNC_3)   /*!< TMR6 unit 1 channel B PWM output */

#define GPIO_FUNC_3_TIM62           (GPIO_FUNC_3)   /*!< TMR6 unit 2 */
#define GPIO_FUNC_3_TIM62_PWMA      (GPIO_FUNC_3)   /*!< TMR6 unit 2 channel A PWM output */
#define GPIO_FUNC_3_TIM62_PWMB      (GPIO_FUNC_3)   /*!< TMR6 unit 2 channel B PWM output */

#define GPIO_FUNC_3_TIM63           (GPIO_FUNC_3)   /*!< TMR6 unit 3 */
#define GPIO_FUNC_3_TIM63_PWMA      (GPIO_FUNC_3)   /*!< TMR6 unit 3 channel A PWM output */
#define GPIO_FUNC_3_TIM63_PWMB      (GPIO_FUNC_3)   /*!< TMR6 unit 3 channel B PWM output */

