RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_gpio.h
#define GPIO_FUNC_3_TIM64           (GPIO_FUNC_3)   /*!< TMR6 unit 4 */
#define GPIO_FUNC_3_TIM64_PWMA      (GPIO_FUNC_3)   /*!< TMR6 unit 4 channel A PWM output */
#define GPIO_FUNC_3_TIM64_PWMB      (GPIO_FUNC_3)   /*!< TMR6 unit 4 channel B PWM output */

#define GPIO_FUNC_3_TIM65           (GPIO_FUNC_3)   /*!< TMR6 unit 5 */
#define GPIO_FUNC_3_TIM65_PWMA      (GPIO_FUNC_3)   /*!< TMR6 unit 5 channel A PWM output */
#define GPIO_FUNC_3_TIM65_PWMB      (GPIO_FUNC_3)   /*!< TMR6 unit 5 channel B PWM output */

#define GPIO_FUNC_3_TIM66           (GPIO_FUNC_3)   /*!< TMR6 unit 6 */
#define GPIO_FUNC_3_TIM66_PWMA      (GPIO_FUNC_3)   /*!< TMR6 unit 6 channel A PWM output */
#define GPIO_FUNC_3_TIM66_PWMB      (GPIO_FUNC_3)   /*!< TMR6 unit 6 channel B PWM output */

#define GPIO_FUNC_3_TIM67           (GPIO_FUNC_3)   /*!< TMR6 unit 7 */
#define GPIO_FUNC_3_TIM67_PWMA      (GPIO_FUNC_3)   /*!< TMR6 unit 7 channel A PWM output */
#define GPIO_FUNC_3_TIM67_PWMB      (GPIO_FUNC_3)   /*!< TMR6 unit 7 channel B PWM output */

#define GPIO_FUNC_3_TIM68           (GPIO_FUNC_3)   /*!< TMR6 unit 8 */
#define GPIO_FUNC_3_TIM68_PWMA      (GPIO_FUNC_3)   /*!< TMR6 unit 8 channel A PWM output */
#define GPIO_FUNC_3_TIM68_PWMB      (GPIO_FUNC_3)   /*!< TMR6 unit 8 channel B PWM output */

/**
 * @}
 */

/** @defgroup GPIO_PinFunction4     GPIO Function 4 selection
 * @{
 */
#define GPIO_FUNC_4                 (0x04U)
#define GPIO_FUNC_4_TIMA1           (GPIO_FUNC_4)   /*!< TMRA unit 1 */
#define GPIO_FUNC_4_TIMA1_TRIG      (GPIO_FUNC_4)   /*!< TMRA unit 1 trigger */
#define GPIO_FUNC_4_TIMA1_PWM1      (GPIO_FUNC_4)   /*!< TMRA unit 1 channel 1 PWM output */
#define GPIO_FUNC_4_TIMA1_PWM2      (GPIO_FUNC_4)   /*!< TMRA unit 1 channel 2 PWM output */
#define GPIO_FUNC_4_TIMA1_PWM3      (GPIO_FUNC_4)   /*!< TMRA unit 1 channel 3 PWM output */
#define GPIO_FUNC_4_TIMA1_PWM4      (GPIO_FUNC_4)   /*!< TMRA unit 1 channel 4 PWM output */

#define GPIO_FUNC_4_TIMA2_PWM       (GPIO_FUNC_4)   /*!< TMRA unit 2 PWM */
#define GPIO_FUNC_4_TIMA2_PWM1      (GPIO_FUNC_4)   /*!< TMRA unit 2 channel 1 PWM output */
#define GPIO_FUNC_4_TIMA2_PWM2      (GPIO_FUNC_4)   /*!< TMRA unit 2 channel 2 PWM output */
#define GPIO_FUNC_4_TIMA2_PWM3      (GPIO_FUNC_4)   /*!< TMRA unit 2 channel 3 PWM output */
#define GPIO_FUNC_4_TIMA2_PWM4      (GPIO_FUNC_4)   /*!< TMRA unit 2 channel 4 PWM output */

#define GPIO_FUNC_4_TIMA3           (GPIO_FUNC_4)   /*!< TMRA unit 3 */
#define GPIO_FUNC_4_TIMA3_TRIG      (GPIO_FUNC_4)   /*!< TMRA unit 3 trigger */
#define GPIO_FUNC_4_TIMA3_PWM1      (GPIO_FUNC_4)   /*!< TMRA unit 3 channel 1 PWM output */
#define GPIO_FUNC_4_TIMA3_PWM2      (GPIO_FUNC_4)   /*!< TMRA unit 3 channel 2 PWM output */
#define GPIO_FUNC_4_TIMA3_PWM3      (GPIO_FUNC_4)   /*!< TMRA unit 3 channel 3 PWM output */
#define GPIO_FUNC_4_TIMA3_PWM4      (GPIO_FUNC_4)   /*!< TMRA unit 3 channel 4 PWM output */

#define GPIO_FUNC_4_TIMA4           (GPIO_FUNC_4)   /*!< TMRA unit 4 */
#define GPIO_FUNC_4_TIMA4_TRIG      (GPIO_FUNC_4)   /*!< TMRA unit 4 trigger */
#define GPIO_FUNC_4_TIMA4_PWM1      (GPIO_FUNC_4)   /*!< TMRA unit 4 channel 1 PWM output */
#define GPIO_FUNC_4_TIMA4_PWM2      (GPIO_FUNC_4)   /*!< TMRA unit 4 channel 2 PWM output */
#define GPIO_FUNC_4_TIMA4_PWM3      (GPIO_FUNC_4)   /*!< TMRA unit 4 channel 3 PWM output */
#define GPIO_FUNC_4_TIMA4_PWM4      (GPIO_FUNC_4)   /*!< TMRA unit 4 channel 4 PWM output */

#define GPIO_FUNC_4_TIMA6           (GPIO_FUNC_4)   /*!< TMRA unit 6 */
#define GPIO_FUNC_4_TIMA6_PWM1      (GPIO_FUNC_4)   /*!< TMRA unit 6 channel 1 PWM output */
#define GPIO_FUNC_4_TIMA6_PWM2      (GPIO_FUNC_4)   /*!< TMRA unit 6 channel 2 PWM output */
#define GPIO_FUNC_4_TIMA6_PWM3      (GPIO_FUNC_4)   /*!< TMRA unit 6 channel 3 PWM output */
#define GPIO_FUNC_4_TIMA6_PWM4      (GPIO_FUNC_4)   /*!< TMRA unit 6 channel 4 PWM output */

#define GPIO_FUNC_4_TIMA7           (GPIO_FUNC_4)   /*!< TMRA unit 7 */
#define GPIO_FUNC_4_TIMA7_PWM1      (GPIO_FUNC_4)   /*!< TMRA unit 7 channel 1 PWM output */
#define GPIO_FUNC_4_TIMA7_PWM2      (GPIO_FUNC_4)   /*!< TMRA unit 7 channel 2 PWM output */
#define GPIO_FUNC_4_TIMA7_PWM3      (GPIO_FUNC_4)   /*!< TMRA unit 7 channel 3 PWM output */
#define GPIO_FUNC_4_TIMA7_PWM4      (GPIO_FUNC_4)   /*!< TMRA unit 7 channel 4 PWM output */

#define GPIO_FUNC_4_TIMA8           (GPIO_FUNC_4)   /*!< TMRA unit 8 */
#define GPIO_FUNC_4_TIMA8_PWM1      (GPIO_FUNC_4)   /*!< TMRA unit 8 channel 1 PWM output */
#define GPIO_FUNC_4_TIMA8_PWM2      (GPIO_FUNC_4)   /*!< TMRA unit 8 channel 2 PWM output */
#define GPIO_FUNC_4_TIMA8_PWM3      (GPIO_FUNC_4)   /*!< TMRA unit 8 channel 3 PWM output */
#define GPIO_FUNC_4_TIMA8_PWM4      (GPIO_FUNC_4)   /*!< TMRA unit 8 channel 4 PWM output */

#define GPIO_FUNC_4_TIMA9           (GPIO_FUNC_4)   /*!< TMRA unit 9 */
#define GPIO_FUNC_4_TIMA9_PWM1      (GPIO_FUNC_4)   /*!< TMRA unit 9 channel 1 PWM output */
#define GPIO_FUNC_4_TIMA9_PWM2      (GPIO_FUNC_4)   /*!< TMRA unit 9 channel 2 PWM output */
#define GPIO_FUNC_4_TIMA9_PWM3      (GPIO_FUNC_4)   /*!< TMRA unit 9 channel 3 PWM output */
#define GPIO_FUNC_4_TIMA9_PWM4      (GPIO_FUNC_4)   /*!< TMRA unit 9 channel 4 PWM output */

#define GPIO_FUNC_4_TIMA10          (GPIO_FUNC_4)   /*!< TMRA unit 10 */
#define GPIO_FUNC_4_TIMA10_PWM1     (GPIO_FUNC_4)   /*!< TMRA unit 10 channel 1 PWM output */
#define GPIO_FUNC_4_TIMA10_PWM2     (GPIO_FUNC_4)   /*!< TMRA unit 10 channel 2 PWM output */
#define GPIO_FUNC_4_TIMA10_PWM3     (GPIO_FUNC_4)   /*!< TMRA unit 10 channel 3 PWM output */
#define GPIO_FUNC_4_TIMA10_PWM4     (GPIO_FUNC_4)   /*!< TMRA unit 10 channel 4 PWM output */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction5 GPIO Function 5 selection
 * @{
 */
#define GPIO_FUNC_5                 (0x05U)
#define GPIO_FUNC_5_TIMA2_TRIG      (GPIO_FUNC_5)   /*!< TMRA unit 2 trigger */

#define GPIO_FUNC_5_TIMA3           (GPIO_FUNC_5)   /*!< TMRA unit 3 */
#define GPIO_FUNC_5_TIMA3_TRIG      (GPIO_FUNC_5)   /*!< TMRA unit 3 trigger */
#define GPIO_FUNC_5_TIMA3_PWM1      (GPIO_FUNC_5)   /*!< TMRA unit 3 channel 1 PWM output */
#define GPIO_FUNC_5_TIMA3_PWM2      (GPIO_FUNC_5)   /*!< TMRA unit 3 channel 2 PWM output */
#define GPIO_FUNC_5_TIMA3_PWM3      (GPIO_FUNC_5)   /*!< TMRA unit 3 channel 3 PWM output */
#define GPIO_FUNC_5_TIMA3_PWM4      (GPIO_FUNC_5)   /*!< TMRA unit 3 channel 4 PWM output */

