RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_gpio.h
#define GPIO_FUNC_5_TIMA4           (GPIO_FUNC_5)   /*!< TMRA unit 4 */
#define GPIO_FUNC_5_TIMA4_PWM1      (GPIO_FUNC_5)   /*!< TMRA unit 4 channel 1 PWM output */
#define GPIO_FUNC_5_TIMA4_PWM2      (GPIO_FUNC_5)   /*!< TMRA unit 4 channel 2 PWM output */
#define GPIO_FUNC_5_TIMA4_PWM3      (GPIO_FUNC_5)   /*!< TMRA unit 4 channel 3 PWM output */
#define GPIO_FUNC_5_TIMA4_PWM4      (GPIO_FUNC_5)   /*!< TMRA unit 4 channel 4 PWM output */

#define GPIO_FUNC_5_TIMA5           (GPIO_FUNC_5)   /*!< TMRA unit 5 */
#define GPIO_FUNC_5_TIMA5_TRIG      (GPIO_FUNC_5)   /*!< TMRA unit 5 trigger */
#define GPIO_FUNC_5_TIMA5_PWM1      (GPIO_FUNC_5)   /*!< TMRA unit 5 channel 1 PWM output */
#define GPIO_FUNC_5_TIMA5_PWM2      (GPIO_FUNC_5)   /*!< TMRA unit 5 channel 2 PWM output */
#define GPIO_FUNC_5_TIMA5_PWM3      (GPIO_FUNC_5)   /*!< TMRA unit 5 channel 3 PWM output */
#define GPIO_FUNC_5_TIMA5_PWM4      (GPIO_FUNC_5)   /*!< TMRA unit 5 channel 4 PWM output */

#define GPIO_FUNC_5_TIMA6           (GPIO_FUNC_5)   /*!< TMRA unit 6 */
#define GPIO_FUNC_5_TIMA6_TRIG      (GPIO_FUNC_5)   /*!< TMRA unit 6 trigger */
#define GPIO_FUNC_5_TIMA6_PWM1      (GPIO_FUNC_5)   /*!< TMRA unit 6 channel 1 PWM output */
#define GPIO_FUNC_5_TIMA6_PWM2      (GPIO_FUNC_5)   /*!< TMRA unit 6 channel 2 PWM output */
#define GPIO_FUNC_5_TIMA6_PWM3      (GPIO_FUNC_5)   /*!< TMRA unit 6 channel 3 PWM output */
#define GPIO_FUNC_5_TIMA6_PWM4      (GPIO_FUNC_5)   /*!< TMRA unit 6 channel 4 PWM output */

#define GPIO_FUNC_5_TIMA9           (GPIO_FUNC_5)   /*!< TMRA unit 9 */
#define GPIO_FUNC_5_TIMA9_TRIG      (GPIO_FUNC_5)   /*!< TMRA unit 9 trigger */
#define GPIO_FUNC_5_TIMA9_PWM1      (GPIO_FUNC_5)   /*!< TMRA unit 9 channel 1 PWM output */
#define GPIO_FUNC_5_TIMA9_PWM2      (GPIO_FUNC_5)   /*!< TMRA unit 9 channel 2 PWM output */
#define GPIO_FUNC_5_TIMA9_PWM3      (GPIO_FUNC_5)   /*!< TMRA unit 9 channel 3 PWM output */
#define GPIO_FUNC_5_TIMA9_PWM4      (GPIO_FUNC_5)   /*!< TMRA unit 9 channel 4 PWM output */

#define GPIO_FUNC_5_TIMA11_PWM      (GPIO_FUNC_5)   /*!< TMRA unit 11 PWM */
#define GPIO_FUNC_5_TIMA11_PWM1     (GPIO_FUNC_5)   /*!< TMRA unit 11 channel 1 PWM output */
#define GPIO_FUNC_5_TIMA11_PWM2     (GPIO_FUNC_5)   /*!< TMRA unit 11 channel 2 PWM output */
#define GPIO_FUNC_5_TIMA11_PWM3     (GPIO_FUNC_5)   /*!< TMRA unit 11 channel 3 PWM output */
#define GPIO_FUNC_5_TIMA11_PWM4     (GPIO_FUNC_5)   /*!< TMRA unit 11 channel 4 PWM output */

#define GPIO_FUNC_5_TIMA12_PWM      (GPIO_FUNC_5)   /*!< TMRA unit 12 PWM */
#define GPIO_FUNC_5_TIMA12_PWM1     (GPIO_FUNC_5)   /*!< TMRA unit 12 channel 1 PWM output */
#define GPIO_FUNC_5_TIMA12_PWM2     (GPIO_FUNC_5)   /*!< TMRA unit 12 channel 2 PWM output */
#define GPIO_FUNC_5_TIMA12_PWM3     (GPIO_FUNC_5)   /*!< TMRA unit 12 channel 3 PWM output */
#define GPIO_FUNC_5_TIMA12_PWM4     (GPIO_FUNC_5)   /*!< TMRA unit 12 channel 4 PWM output */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction6 GPIO Function 6 selection
 * @{
 */
#define GPIO_FUNC_6                 (0x06U)
#define GPIO_FUNC_6_TIMA1_TRIG      (GPIO_FUNC_6)   /*!< TMRA unit 1 trigger */
#define GPIO_FUNC_6_TIMA2_TRIG      (GPIO_FUNC_6)   /*!< TMRA unit 2 trigger */
#define GPIO_FUNC_6_TIMA3_TRIG      (GPIO_FUNC_6)   /*!< TMRA unit 3 trigger */
#define GPIO_FUNC_6_TIMA4_TRIG      (GPIO_FUNC_6)   /*!< TMRA unit 4 trigger */
#define GPIO_FUNC_6_TIMA6_TRIG      (GPIO_FUNC_6)   /*!< TMRA unit 6 trigger */
#define GPIO_FUNC_6_TIMA7_TRIG      (GPIO_FUNC_6)   /*!< TMRA unit 7 trigger */
#define GPIO_FUNC_6_TIMA8_TRIG      (GPIO_FUNC_6)   /*!< TMRA unit 8 trigger */
#define GPIO_FUNC_6_TIMA11_TRIG     (GPIO_FUNC_6)   /*!< TMRA unit 11 trigger */
#define GPIO_FUNC_6_TIMA12_TRIG     (GPIO_FUNC_6)   /*!< TMRA unit 12 trigger */

#define GPIO_FUNC_6_TIMA5           (GPIO_FUNC_6)   /*!< TMRA unit 5 */
#define GPIO_FUNC_6_TIMA5_TRIG      (GPIO_FUNC_6)   /*!< TMRA unit 5 trigger */
#define GPIO_FUNC_6_TIMA5_PWM1      (GPIO_FUNC_6)   /*!< TMRA unit 5 channel 1 PWM output */
#define GPIO_FUNC_6_TIMA5_PWM2      (GPIO_FUNC_6)   /*!< TMRA unit 5 channel 2 PWM output */
#define GPIO_FUNC_6_TIMA5_PWM3      (GPIO_FUNC_6)   /*!< TMRA unit 5 channel 3 PWM output */
#define GPIO_FUNC_6_TIMA5_PWM4      (GPIO_FUNC_6)   /*!< TMRA unit 5 channel 4 PWM output */

#define GPIO_FUNC_6_TIMA9           (GPIO_FUNC_6)   /*!< TMRA unit 9 */
#define GPIO_FUNC_6_TIMA9_TRIG      (GPIO_FUNC_6)   /*!< TMRA unit 9 trigger */
#define GPIO_FUNC_6_TIMA9_PWM1      (GPIO_FUNC_6)   /*!< TMRA unit 9 channel 1 PWM output */
#define GPIO_FUNC_6_TIMA9_PWM2      (GPIO_FUNC_6)   /*!< TMRA unit 9 channel 2 PWM output */
#define GPIO_FUNC_6_TIMA9_PWM3      (GPIO_FUNC_6)   /*!< TMRA unit 9 channel 3 PWM output */
#define GPIO_FUNC_6_TIMA9_PWM4      (GPIO_FUNC_6)   /*!< TMRA unit 9 channel 4 PWM output */

#define GPIO_FUNC_6_TIMA10          (GPIO_FUNC_6)   /*!< TMRA unit 10 */
#define GPIO_FUNC_6_TIMA10_TRIG     (GPIO_FUNC_6)   /*!< TMRA unit 10 trigger */
#define GPIO_FUNC_6_TIMA10_PWM1     (GPIO_FUNC_6)   /*!< TMRA unit 10 channel 1 PWM output */
#define GPIO_FUNC_6_TIMA10_PWM2     (GPIO_FUNC_6)   /*!< TMRA unit 10 channel 2 PWM output */
#define GPIO_FUNC_6_TIMA10_PWM3     (GPIO_FUNC_6)   /*!< TMRA unit 10 channel 3 PWM output */
#define GPIO_FUNC_6_TIMA10_PWM4     (GPIO_FUNC_6)   /*!< TMRA unit 10 channel 4 PWM output */

#define GPIO_FUNC_6_TIM65_PWMA      (GPIO_FUNC_6)   /*!< TMR6 unit 5 channel A PWM output */
#define GPIO_FUNC_6_TIM66_PWMA      (GPIO_FUNC_6)   /*!< TMR6 unit 6 channel A PWM output */
#define GPIO_FUNC_6_TIM67_PWMA      (GPIO_FUNC_6)   /*!< TMR6 unit 7 channel A PWM output */
#define GPIO_FUNC_6_TIM68_PWMA      (GPIO_FUNC_6)   /*!< TMR6 unit 8 channel A PWM output */

#define GPIO_FUNC_6_EMB_PORT        (GPIO_FUNC_6)   /*!< EMB port */
#define GPIO_FUNC_6_EMB_PORT0       (GPIO_FUNC_6)   /*!< EMB port 0 */
#define GPIO_FUNC_6_EMB_PORT1       (GPIO_FUNC_6)   /*!< EMB port 1 */
#define GPIO_FUNC_6_EMB_PORT2       (GPIO_FUNC_6)   /*!< EMB port 2 */
#define GPIO_FUNC_6_EMB_PORT3       (GPIO_FUNC_6)   /*!< EMB port 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction7 GPIO Function 7 selection
 * @{
 */
#define GPIO_FUNC_7                 (0x07U)
#define GPIO_FUNC_7_USART1          (GPIO_FUNC_7)     /*!< USART1 */
#define GPIO_FUNC_7_USART1_CK       (GPIO_FUNC_7)     /*!< USART1 CK */
#define GPIO_FUNC_7_USART1_CTS      (GPIO_FUNC_7)     /*!< USART1 CTS */
#define GPIO_FUNC_7_USART1_RTS      (GPIO_FUNC_7)     /*!< USART1 RTS */

#define GPIO_FUNC_7_USART2          (GPIO_FUNC_7)     /*!< USART2 */
#define GPIO_FUNC_7_USART2_CK       (GPIO_FUNC_7)     /*!< USART2 CK */
#define GPIO_FUNC_7_USART2_CTS      (GPIO_FUNC_7)     /*!< USART2 CTS */
#define GPIO_FUNC_7_USART2_RTS      (GPIO_FUNC_7)     /*!< USART2 RTS */

