RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_gpio.h
#define GPIO_FUNC_7_USART3          (GPIO_FUNC_7)     /*!< USART3 */
#define GPIO_FUNC_7_USART3_CK       (GPIO_FUNC_7)     /*!< USART3 CK */
#define GPIO_FUNC_7_USART3_CTS      (GPIO_FUNC_7)     /*!< USART3 CTS */
#define GPIO_FUNC_7_USART3_RTS      (GPIO_FUNC_7)     /*!< USART3 RTS */

#define GPIO_FUNC_7_USART4          (GPIO_FUNC_7)     /*!< USART4 */
#define GPIO_FUNC_7_USART4_CK       (GPIO_FUNC_7)     /*!< USART4 CK */
#define GPIO_FUNC_7_USART4_CTS      (GPIO_FUNC_7)     /*!< USART4 CTS */
#define GPIO_FUNC_7_USART4_RTS      (GPIO_FUNC_7)     /*!< USART4 RTS */

#define GPIO_FUNC_7_USART5          (GPIO_FUNC_7)     /*!< USART5 */
#define GPIO_FUNC_7_USART5_CK       (GPIO_FUNC_7)     /*!< USART5 CK */
#define GPIO_FUNC_7_USART5_CTS      (GPIO_FUNC_7)     /*!< USART5 CTS */
#define GPIO_FUNC_7_USART5_RTS      (GPIO_FUNC_7)     /*!< USART5 RTS */

#define GPIO_FUNC_7_USART6          (GPIO_FUNC_7)     /*!< USART6 */
#define GPIO_FUNC_7_USART6_CK       (GPIO_FUNC_7)     /*!< USART6 CK */
#define GPIO_FUNC_7_USART6_CTS      (GPIO_FUNC_7)     /*!< USART6 CTS */
#define GPIO_FUNC_7_USART6_RTS      (GPIO_FUNC_7)     /*!< USART6 RTS */

#define GPIO_FUNC_7_USART7          (GPIO_FUNC_7)     /*!< USART7 */
#define GPIO_FUNC_7_USART7_CK       (GPIO_FUNC_7)     /*!< USART7 CK */
#define GPIO_FUNC_7_USART7_CTS      (GPIO_FUNC_7)     /*!< USART7 CTS */
#define GPIO_FUNC_7_USART7_RTS      (GPIO_FUNC_7)     /*!< USART7 RTS */

#define GPIO_FUNC_7_USART8          (GPIO_FUNC_7)     /*!< USART8 */
#define GPIO_FUNC_7_USART8_CK       (GPIO_FUNC_7)     /*!< USART8 CK */
#define GPIO_FUNC_7_USART8_CTS      (GPIO_FUNC_7)     /*!< USART8 CTS */
#define GPIO_FUNC_7_USART8_RTS      (GPIO_FUNC_7)     /*!< USART8 RTS */

#define GPIO_FUNC_7_USART9          (GPIO_FUNC_7)     /*!< USART9 */
#define GPIO_FUNC_7_USART9_CK       (GPIO_FUNC_7)     /*!< USART9 CK */
#define GPIO_FUNC_7_USART9_CTS      (GPIO_FUNC_7)     /*!< USART9 CTS */
#define GPIO_FUNC_7_USART9_RTS      (GPIO_FUNC_7)     /*!< USART9 RTS */

#define GPIO_FUNC_7_USART10         (GPIO_FUNC_7)     /*!< USART10 */
#define GPIO_FUNC_7_USART10_CK      (GPIO_FUNC_7)     /*!< USART10 CK */
#define GPIO_FUNC_7_USART10_CTS     (GPIO_FUNC_7)     /*!< USART10 CTS */
#define GPIO_FUNC_7_USART10_RTS     (GPIO_FUNC_7)     /*!< USART10 RTS */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction8 GPIO Function 8 selection
 * @{
 */
#define GPIO_FUNC_8                 (0x08U)
#define GPIO_FUNC_8_KEYSCAN         (GPIO_FUNC_8)     /*!< KEYSCAN */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction9 GPIO Function 9 selection
 * @{
 */
#define GPIO_FUNC_9                 (0x09U)
#define GPIO_FUNC_9_SDIO            (GPIO_FUNC_9)     /*!< SDIO */
#define GPIO_FUNC_9_SDIO1           (GPIO_FUNC_9)     /*!< SDIO1 */
#define GPIO_FUNC_9_SDIO1_WP        (GPIO_FUNC_9)     /*!< SDIO1 WP */
#define GPIO_FUNC_9_SDIO1_CD        (GPIO_FUNC_9)     /*!< SDIO1 CD */
#define GPIO_FUNC_9_SDIO1_CMD       (GPIO_FUNC_9)     /*!< SDIO1 CMD */
#define GPIO_FUNC_9_SDIO1_CK        (GPIO_FUNC_9)     /*!< SDIO1 CK */
#define GPIO_FUNC_9_SDIO1_DATA      (GPIO_FUNC_9)     /*!< SDIO1 data bus */

#define GPIO_FUNC_9_SDIO2           (GPIO_FUNC_9)     /*!< SDIO2 */
#define GPIO_FUNC_9_SDIO2_WP        (GPIO_FUNC_9)     /*!< SDIO2 WP */
#define GPIO_FUNC_9_SDIO2_CD        (GPIO_FUNC_9)     /*!< SDIO2 CD */
#define GPIO_FUNC_9_SDIO2_CMD       (GPIO_FUNC_9)     /*!< SDIO2 CMD */
#define GPIO_FUNC_9_SDIO2_CK        (GPIO_FUNC_9)     /*!< SDIO2 CK */
#define GPIO_FUNC_9_SDIO2_DATA      (GPIO_FUNC_9)     /*!< SDIO2 data bus */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction10 GPIO Function 10 selection
 * @{
 */
#define GPIO_FUNC_10                    (0x0AU)
#define GPIO_FUNC_10_USBF               (GPIO_FUNC_10)    /*!< USB Full-speed */
#define GPIO_FUNC_10_USBF_DRVVBUS       (GPIO_FUNC_10)    /*!< USB Full-speed host VBUS ctrl */
#define GPIO_FUNC_10_USBF_SOF           (GPIO_FUNC_10)    /*!< USB Full-speed SOF */
#define GPIO_FUNC_10_USBF_VBUS          (GPIO_FUNC_10)    /*!< USB Full-speed slave VBUS */
#define GPIO_FUNC_10_USBF_ID            (GPIO_FUNC_10)    /*!< USB Full-speed */

#define GPIO_FUNC_10_USBH               (GPIO_FUNC_10)    /*!< USB High-speed */
#define GPIO_FUNC_10_USBH_ULPI_DIR      (GPIO_FUNC_10)    /*!< USB High-speed ULPI DIR */
#define GPIO_FUNC_10_USBH_ULPI_STP      (GPIO_FUNC_10)    /*!< USB High-speed ULPI STP */
#define GPIO_FUNC_10_USBH_ULPI_NXT      (GPIO_FUNC_10)    /*!< USB High-speed ULPI NXT */
#define GPIO_FUNC_10_USBH_ULPI_CK       (GPIO_FUNC_10)    /*!< USB High-speed ULPI CK */
#define GPIO_FUNC_10_USBH_ULPI_DRVVBUS  (GPIO_FUNC_10)    /*!< USB High-speed host VBUS ctrl */
#define GPIO_FUNC_10_USBH_ULPI_DATA     (GPIO_FUNC_10)    /*!< USB High-speed ULPI data bus */

#define GPIO_FUNC_10_TIM22_PWM          (GPIO_FUNC_10)    /*!< TMR2 unit 2 PWM */
#define GPIO_FUNC_10_TIM22_PWMA         (GPIO_FUNC_10)    /*!< TMR2 unit 2 channel A PWM */
#define GPIO_FUNC_10_TIM22_PWMB         (GPIO_FUNC_10)    /*!< TMR2 unit 2 channel B PWM */

#define GPIO_FUNC_10_TIM24_PWM          (GPIO_FUNC_10)    /*!< TMR2 unit 4 PWM */
#define GPIO_FUNC_10_TIM24_PWMA         (GPIO_FUNC_10)    /*!< TMR2 unit 4 channel A PWM */
#define GPIO_FUNC_10_TIM24_PWMB         (GPIO_FUNC_10)    /*!< TMR2 unit 4 channel B PWM */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction11 GPIO Function 11 selection
 * @{
 */
#define GPIO_FUNC_11                (0x0BU)
#define GPIO_FUNC_11_ETH            (GPIO_FUNC_11)      /*!< Ethernet */
#define GPIO_FUNC_11_ETH_TXD        (GPIO_FUNC_11)      /*!< ETH TXD */
#define GPIO_FUNC_11_ETH_TXEN       (GPIO_FUNC_11)      /*!< ETH TX enable */
#define GPIO_FUNC_11_ETH_TXCLK      (GPIO_FUNC_11)      /*!< ETH TX clock */
#define GPIO_FUNC_11_ETH_RXD        (GPIO_FUNC_11)      /*!< ETH RXD */
#define GPIO_FUNC_11_ETH_RXER       (GPIO_FUNC_11)      /*!< ETH RX error */
#define GPIO_FUNC_11_ETH_RXCLK      (GPIO_FUNC_11)      /*!< ETH RX clock */
#define GPIO_FUNC_11_ETH_RXDV       (GPIO_FUNC_11)      /*!< ETH RX data valid */
#define GPIO_FUNC_11_ETH_SMI_MDIO   (GPIO_FUNC_11)      /*!< SMI data */
#define GPIO_FUNC_11_ETH_SMI_MDC    (GPIO_FUNC_11)      /*!< SMI clock */
#define GPIO_FUNC_11_ETH_CRS        (GPIO_FUNC_11)      /*!< ETH MII carrier sense */
#define GPIO_FUNC_11_ETH_COL        (GPIO_FUNC_11)      /*!< ETH MII collisioin detected */
#define GPIO_FUNC_11_ETH_PPS_OUT    (GPIO_FUNC_11)      /*!< ETH PPS out */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction12 GPIO Function 12 selection
 * @{
 */
#define GPIO_FUNC_12                (0x0CU)
#define GPIO_FUNC_12_EXMC           (GPIO_FUNC_12)      /*!< Ext. Bus */
#define GPIO_FUNC_12_EXMC_CLE       (GPIO_FUNC_12)      /*!< Ext. Bus NAND CMD latch */
#define GPIO_FUNC_12_EXMC_ALE       (GPIO_FUNC_12)      /*!< Ext. Bus NAND ADDR latch */
#define GPIO_FUNC_12_EXMC_RB        (GPIO_FUNC_12)      /*!< Ext. Bus NAND busy or SRAM wait(RB0) input */
#define GPIO_FUNC_12_EXMC_CE        (GPIO_FUNC_12)      /*!< Ext. Bus chip enable */
#define GPIO_FUNC_12_EXMC_WE        (GPIO_FUNC_12)      /*!< Ext. Bus write enable */
#define GPIO_FUNC_12_EXMC_OE        (GPIO_FUNC_12)      /*!< Ext. Bus output enable */
#define GPIO_FUNC_12_EXMC_BAA       (GPIO_FUNC_12)      /*!< Ext. Bus SRAM BAA */
#define GPIO_FUNC_12_EXMC_ADV       (GPIO_FUNC_12)      /*!< Ext. Bus SRAM ADDR latch */
#define GPIO_FUNC_12_EXMC_CLK       (GPIO_FUNC_12)      /*!< Ext. Bus clock output */
#define GPIO_FUNC_12_EXMC_ADDR      (GPIO_FUNC_12)      /*!< Ext. Bus Addr. Bus */
#define GPIO_FUNC_12_EXMC_DATA      (GPIO_FUNC_12)      /*!< Ext. Bus data Bus */

#define GPIO_FUNC_12_USBH           (GPIO_FUNC_12)      /*!< USB High-speed */
#define GPIO_FUNC_12_USBH_SOF       (GPIO_FUNC_12)      /*!< USB High-speed SOF */
#define GPIO_FUNC_12_USBH_VBUS      (GPIO_FUNC_12)      /*!< USB High-speed slave VBUS */
#define GPIO_FUNC_12_USBH_ID        (GPIO_FUNC_12)      /*!< USB High-speed ID */

