RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_gpio.h
#define GPIO_FUNC_12_I2S2_EXCK      (GPIO_FUNC_12)      /*!< I2S2 EXCK */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction13 GPIO Function 13 selection
 * @{
 */
#define GPIO_FUNC_13                (0x0DU)
#define GPIO_FUNC_13_DVP            (GPIO_FUNC_13)      /*!< DVP */
#define GPIO_FUNC_13_DVP_DATA       (GPIO_FUNC_13)      /*!< DVP data bus */
#define GPIO_FUNC_13_DVP_PIXCLK     (GPIO_FUNC_13)      /*!< DVP pix clock */
#define GPIO_FUNC_13_DVP_HSYNC      (GPIO_FUNC_13)      /*!< DVP line sync */
#define GPIO_FUNC_13_DVP_VSYNC      (GPIO_FUNC_13)      /*!< DVP frame sync */

#define GPIO_FUNC_13_EXMC           (GPIO_FUNC_13)      /*!< Ext. Bus */
#define GPIO_FUNC_13_EXMC_A16       (GPIO_FUNC_13)      /*!< Ext. Bus address 16 */
#define GPIO_FUNC_13_EXMC_A17       (GPIO_FUNC_13)      /*!< Ext. Bus address 17 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction14 GPIO Function 14 selection
 * @{
 */
#define GPIO_FUNC_14                (0x0EU)
#define GPIO_FUNC_14_EP             (GPIO_FUNC_14)      /*!< Event Port */
#define GPIO_FUNC_14_EP1            (GPIO_FUNC_14)      /*!< Event Port Group 1 */
#define GPIO_FUNC_14_EP2            (GPIO_FUNC_14)      /*!< Event Port Group 2 */
#define GPIO_FUNC_14_EP3            (GPIO_FUNC_14)      /*!< Event Port Group 3 */
#define GPIO_FUNC_14_EP4            (GPIO_FUNC_14)      /*!< Event Port Group 4 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction15 GPIO Function 15 selection
 * @{
 */
#define GPIO_FUNC_15                (0x0FU)
#define GPIO_FUNC_15_EVENTOUT       (GPIO_FUNC_15)      /*!< Event Out */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction16 GPIO Function 16 selection
 * @{
 */
#define GPIO_FUNC_16                (0x10U)
#define GPIO_FUNC_16_TIM21          (GPIO_FUNC_16)      /*!< TMR2 unit 1 */
#define GPIO_FUNC_16_TIM21_CLKA     (GPIO_FUNC_16)      /*!< TMR2 unit 1 channel A CLK input */
#define GPIO_FUNC_16_TIM21_CLKB     (GPIO_FUNC_16)      /*!< TMR2 unit 1 channel B CLK input */
#define GPIO_FUNC_16_TIM21_PWMA     (GPIO_FUNC_16)      /*!< TMR2 unit 1 channel A PWM output */
#define GPIO_FUNC_16_TIM21_PWMB     (GPIO_FUNC_16)      /*!< TMR2 unit 1 channel B PWM output */

#define GPIO_FUNC_16_TIM22          (GPIO_FUNC_16)      /*!< TMR2 unit 2 */
#define GPIO_FUNC_16_TIM22_CLKA     (GPIO_FUNC_16)      /*!< TMR2 unit 2 channel A CLK input */
#define GPIO_FUNC_16_TIM22_CLKB     (GPIO_FUNC_16)      /*!< TMR2 unit 2 channel B CLK input */
#define GPIO_FUNC_16_TIM22_PWMA     (GPIO_FUNC_16)      /*!< TMR2 unit 2 channel A PWM output */
#define GPIO_FUNC_16_TIM22_PWMB     (GPIO_FUNC_16)      /*!< TMR2 unit 2 channel B PWM output */

#define GPIO_FUNC_16_TIM23          (GPIO_FUNC_16)      /*!< TMR2 unit 3 */
#define GPIO_FUNC_16_TIM23_CLKA     (GPIO_FUNC_16)      /*!< TMR2 unit 3 channel A CLK input */
#define GPIO_FUNC_16_TIM23_CLKB     (GPIO_FUNC_16)      /*!< TMR2 unit 3 channel B CLK input */
#define GPIO_FUNC_16_TIM23_PWMA     (GPIO_FUNC_16)      /*!< TMR2 unit 3 channel A PWM output */
#define GPIO_FUNC_16_TIM23_PWMB     (GPIO_FUNC_16)      /*!< TMR2 unit 3 channel B PWM output */

#define GPIO_FUNC_16_TIM24          (GPIO_FUNC_16)      /*!< TMR2 unit 4 */
#define GPIO_FUNC_16_TIM24_CLKA     (GPIO_FUNC_16)      /*!< TMR2 unit 4 channel A CLK input */
#define GPIO_FUNC_16_TIM24_CLKB     (GPIO_FUNC_16)      /*!< TMR2 unit 4 channel B CLK input */
#define GPIO_FUNC_16_TIM24_PWMA     (GPIO_FUNC_16)      /*!< TMR2 unit 4 channel A PWM output */
#define GPIO_FUNC_16_TIM24_PWMB     (GPIO_FUNC_16)      /*!< TMR2 unit 4 channel B PWM output */

#define GPIO_FUNC_16_TIM41_CLK      (GPIO_FUNC_16)      /*!< TMR4 unit 1 CLK input */

#define GPIO_FUNC_16_TIM42_CLK      (GPIO_FUNC_16)      /*!< TMR4 unit 2 CLK input */
#define GPIO_FUNC_16_TIM42_OUL      (GPIO_FUNC_16)      /*!< TMR4 unit 2 U-phase low output */
#define GPIO_FUNC_16_TIM42_OVL      (GPIO_FUNC_16)      /*!< TMR4 unit 2 V-phase low output */
#define GPIO_FUNC_16_TIM42_OWL      (GPIO_FUNC_16)      /*!< TMR4 unit 2 W-phase low output */

#define GPIO_FUNC_16_TIM43_ADSM     (GPIO_FUNC_16)      /*!< TMR4 unit 3 special event */

/**
 * @}
 */

/** @defgroup GPIO_PinFunction17 GPIO Function 17 selection
 * @{
 */
#define GPIO_FUNC_17                (0x11U)
#define GPIO_FUNC_17_I2S1           (GPIO_FUNC_17)      /*!< I2S1 */
#define GPIO_FUNC_17_I2S1_MCK       (GPIO_FUNC_17)      /*!< I2S1 MCK */
#define GPIO_FUNC_17_I2S1_EXCK      (GPIO_FUNC_17)      /*!< I2S1 EXCK */
#define GPIO_FUNC_17_I2S1_SDIN      (GPIO_FUNC_17)      /*!< I2S1 SDIN */

#define GPIO_FUNC_17_I2S2           (GPIO_FUNC_17)      /*!< I2S2 */
#define GPIO_FUNC_17_I2S2_CK        (GPIO_FUNC_17)      /*!< I2S2 CK */
#define GPIO_FUNC_17_I2S2_MCK       (GPIO_FUNC_17)      /*!< I2S2 MCK */
#define GPIO_FUNC_17_I2S2_EXCK      (GPIO_FUNC_17)      /*!< I2S2 EXCK */
#define GPIO_FUNC_17_I2S2_SD        (GPIO_FUNC_17)      /*!< I2S2 SD */
#define GPIO_FUNC_17_I2S2_SDIN      (GPIO_FUNC_17)      /*!< I2S2 SDIN */

#define GPIO_FUNC_17_I2S3           (GPIO_FUNC_17)      /*!< I2S3 */
#define GPIO_FUNC_17_I2S3_MCK       (GPIO_FUNC_17)      /*!< I2S3 MCK */
#define GPIO_FUNC_17_I2S3_EXCK      (GPIO_FUNC_17)      /*!< I2S3 EXCK */
#define GPIO_FUNC_17_I2S3_SDIN      (GPIO_FUNC_17)      /*!< I2S3 SDIN */

#define GPIO_FUNC_17_I2S4           (GPIO_FUNC_17)      /*!< I2S4 */
#define GPIO_FUNC_17_I2S4_MCK       (GPIO_FUNC_17)      /*!< I2S4 MCK */
#define GPIO_FUNC_17_I2S4_EXCK      (GPIO_FUNC_17)      /*!< I2S4 EXCK */
#define GPIO_FUNC_17_I2S4_SDIN      (GPIO_FUNC_17)      /*!< I2S4 SDIN */
#define GPIO_FUNC_17_I2S4_SD        (GPIO_FUNC_17)      /*!< I2S4 SD */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction18 GPIO Function 18 selection
 * @{
 */
#define GPIO_FUNC_18                (0x12U)
#define GPIO_FUNC_18_SPI1           (GPIO_FUNC_18)      /*!< SPI1 */
#define GPIO_FUNC_18_SPI1_NSS1      (GPIO_FUNC_18)      /*!< SPI1 NSS1 */
#define GPIO_FUNC_18_SPI1_NSS2      (GPIO_FUNC_18)      /*!< SPI1 NSS2 */
#define GPIO_FUNC_18_SPI1_NSS3      (GPIO_FUNC_18)      /*!< SPI1 NSS3 */

#define GPIO_FUNC_18_SPI2           (GPIO_FUNC_18)      /*!< SPI2 */
#define GPIO_FUNC_18_SPI2_NSS0      (GPIO_FUNC_18)      /*!< SPI2 NSS0 */
#define GPIO_FUNC_18_SPI2_NSS1      (GPIO_FUNC_18)      /*!< SPI2 NSS1 */
#define GPIO_FUNC_18_SPI2_NSS2      (GPIO_FUNC_18)      /*!< SPI2 NSS2 */
#define GPIO_FUNC_18_SPI2_NSS3      (GPIO_FUNC_18)      /*!< SPI2 NSS3 */

#define GPIO_FUNC_18_SPI3           (GPIO_FUNC_18)      /*!< SPI3 */
#define GPIO_FUNC_18_SPI3_NSS1      (GPIO_FUNC_18)      /*!< SPI3 NSS1 */
#define GPIO_FUNC_18_SPI3_NSS2      (GPIO_FUNC_18)      /*!< SPI3 NSS2 */
#define GPIO_FUNC_18_SPI3_NSS3      (GPIO_FUNC_18)      /*!< SPI3 NSS3 */

#define GPIO_FUNC_18_SPI4           (GPIO_FUNC_18)      /*!< SPI4 */
#define GPIO_FUNC_18_SPI4_NSS1      (GPIO_FUNC_18)      /*!< SPI4 NSS1 */
#define GPIO_FUNC_18_SPI4_NSS2      (GPIO_FUNC_18)      /*!< SPI4 NSS2 */
#define GPIO_FUNC_18_SPI4_NSS3      (GPIO_FUNC_18)      /*!< SPI4 NSS3 */

#define GPIO_FUNC_18_SPI5           (GPIO_FUNC_18)      /*!< SPI5 */
#define GPIO_FUNC_18_SPI5_NSS0      (GPIO_FUNC_18)      /*!< SPI5 NSS0 */
#define GPIO_FUNC_18_SPI5_NSS1      (GPIO_FUNC_18)      /*!< SPI5 NSS1 */
#define GPIO_FUNC_18_SPI5_NSS2      (GPIO_FUNC_18)      /*!< SPI5 NSS2 */
#define GPIO_FUNC_18_SPI5_NSS3      (GPIO_FUNC_18)      /*!< SPI5 NSS3 */

#define GPIO_FUNC_18_SPI6           (GPIO_FUNC_18)      /*!< SPI6 */
#define GPIO_FUNC_18_SPI6_NSS1      (GPIO_FUNC_18)      /*!< SPI6 NSS1 */
#define GPIO_FUNC_18_SPI6_NSS2      (GPIO_FUNC_18)      /*!< SPI6 NSS2 */
#define GPIO_FUNC_18_SPI6_NSS3      (GPIO_FUNC_18)      /*!< SPI6 NSS3 */

#define GPIO_FUNC_18_QSPI           (GPIO_FUNC_18)      /*!< QSPI */
#define GPIO_FUNC_18_QSPI_NSS       (GPIO_FUNC_18)      /*!< QSPI NSS */
#define GPIO_FUNC_18_QSPI_SCK       (GPIO_FUNC_18)      /*!< QSPI SCK */
#define GPIO_FUNC_18_QSPI_IO0       (GPIO_FUNC_18)      /*!< QSPI IO0 */
#define GPIO_FUNC_18_QSPI_IO1       (GPIO_FUNC_18)      /*!< QSPI IO1 */
#define GPIO_FUNC_18_QSPI_IO2       (GPIO_FUNC_18)      /*!< QSPI IO2 */
#define GPIO_FUNC_18_QSPI_IO3       (GPIO_FUNC_18)      /*!< QSPI IO3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction19 GPIO Function 19 selection
 * @{
 */
#define GPIO_FUNC_19                (0x13U)
#define GPIO_FUNC_19_SPI1           (GPIO_FUNC_19)      /*!< SPI1 */
#define GPIO_FUNC_19_SPI1_NSS0      (GPIO_FUNC_19)      /*!< SPI1 NSS0 */

