RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_gpio.h
#define GPIO_FUNC_19_SPI2           (GPIO_FUNC_19)      /*!< SPI2 */
#define GPIO_FUNC_19_SPI2_NSS0      (GPIO_FUNC_19)      /*!< SPI2 NSS0 */
#define GPIO_FUNC_19_SPI2_MOSI      (GPIO_FUNC_19)      /*!< SPI2 MOSI */
#define GPIO_FUNC_19_SPI2_MISO      (GPIO_FUNC_19)      /*!< SPI2 MISO */
#define GPIO_FUNC_19_SPI2_SCK       (GPIO_FUNC_19)      /*!< SPI2 SCK */

#define GPIO_FUNC_19_SPI3           (GPIO_FUNC_19)      /*!< SPI3 */
#define GPIO_FUNC_19_SPI3_NSS0      (GPIO_FUNC_19)      /*!< SPI3 NSS0 */
#define GPIO_FUNC_19_SPI3_MOSI      (GPIO_FUNC_19)      /*!< SPI3 MOSI */
#define GPIO_FUNC_19_SPI3_MISO      (GPIO_FUNC_19)      /*!< SPI3 MISO */
#define GPIO_FUNC_19_SPI3_SCK       (GPIO_FUNC_19)      /*!< SPI3 SCK */

#define GPIO_FUNC_19_SPI            (GPIO_FUNC_19)      /*!< SPI4 */
#define GPIO_FUNC_19_SPI4_NSS0      (GPIO_FUNC_19)      /*!< SPI4 NSS0 */

#define GPIO_FUNC_19_SPI5           (GPIO_FUNC_19)      /*!< SPI5 */
#define GPIO_FUNC_19_SPI5_NSS0      (GPIO_FUNC_19)      /*!< SPI5 NSS0 */
#define GPIO_FUNC_19_SPI5_MOSI      (GPIO_FUNC_19)      /*!< SPI5 MOSI */
#define GPIO_FUNC_19_SPI5_MISO      (GPIO_FUNC_19)      /*!< SPI5 MISO */
#define GPIO_FUNC_19_SPI5_SCK       (GPIO_FUNC_19)      /*!< SPI5 SCK */

#define GPIO_FUNC_19_SPI6           (GPIO_FUNC_19)      /*!< SPI6 */
#define GPIO_FUNC_19_SPI6_NSS0      (GPIO_FUNC_19)      /*!< SPI6 NSS0 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction20 GPIO Function 20 selection
 * @{
 */
#define GPIO_FUNC_20                (0x14U)
#define GPIO_FUNC_20_USART1         (GPIO_FUNC_20)      /*!< USART1 */
#define GPIO_FUNC_20_USART1_TX      (GPIO_FUNC_20)      /*!< USART1 TX */
#define GPIO_FUNC_20_USART1_RX      (GPIO_FUNC_20)      /*!< USART1 RX */
#define GPIO_FUNC_20_USART1_CTS     (GPIO_FUNC_20)      /*!< USART1 CTS */
#define GPIO_FUNC_20_USART1_RTS     (GPIO_FUNC_20)      /*!< USART1 RTS */
#define GPIO_FUNC_20_USART1_CK      (GPIO_FUNC_20)      /*!< USART1 CK */

#define GPIO_FUNC_20_USART2         (GPIO_FUNC_20)      /*!< USART2 */
#define GPIO_FUNC_20_USART2_TX      (GPIO_FUNC_20)      /*!< USART2 TX */
#define GPIO_FUNC_20_USART2_RX      (GPIO_FUNC_20)      /*!< USART2 RX */
#define GPIO_FUNC_20_USART2_CTS     (GPIO_FUNC_20)      /*!< USART2 CTS */
#define GPIO_FUNC_20_USART2_RTS     (GPIO_FUNC_20)      /*!< USART2 RTS */
#define GPIO_FUNC_20_USART2_CK      (GPIO_FUNC_20)      /*!< USART2 CK */

#define GPIO_FUNC_20_USART4         (GPIO_FUNC_20)      /*!< USART4 */
#define GPIO_FUNC_20_USART4_TX      (GPIO_FUNC_20)      /*!< USART4 TX */
#define GPIO_FUNC_20_USART4_RX      (GPIO_FUNC_20)      /*!< USART4 RX */

#define GPIO_FUNC_20_USART5         (GPIO_FUNC_20)      /*!< USART5 */
#define GPIO_FUNC_20_USART5_TX      (GPIO_FUNC_20)      /*!< USART5 TX */
#define GPIO_FUNC_20_USART5_RX      (GPIO_FUNC_20)      /*!< USART5 RX */

#define GPIO_FUNC_20_USART6         (GPIO_FUNC_20)      /*!< USART6 */
#define GPIO_FUNC_20_USART6_TX      (GPIO_FUNC_20)      /*!< USART6 TX */
#define GPIO_FUNC_20_USART6_RX      (GPIO_FUNC_20)      /*!< USART6 RX */
#define GPIO_FUNC_20_USART6_CTS     (GPIO_FUNC_20)      /*!< USART6 CTS */
#define GPIO_FUNC_20_USART6_RTS     (GPIO_FUNC_20)      /*!< USART6 RTS */
#define GPIO_FUNC_20_USART6_CK      (GPIO_FUNC_20)      /*!< USART6 CK */

#define GPIO_FUNC_20_USART7         (GPIO_FUNC_20)      /*!< USART7 */
#define GPIO_FUNC_20_USART7_TX      (GPIO_FUNC_20)      /*!< USART7 TX */
#define GPIO_FUNC_20_USART7_RX      (GPIO_FUNC_20)      /*!< USART7 RX */

#define GPIO_FUNC_20_USART8         (GPIO_FUNC_20)      /*!< USART8 */
#define GPIO_FUNC_20_USART8_TX      (GPIO_FUNC_20)      /*!< USART8 TX */
#define GPIO_FUNC_20_USART8_RX      (GPIO_FUNC_20)      /*!< USART8 RX */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction32 GPIO Function 32 selection
 * @{
 */
#define GPIO_FUNC_32                (0x20U)
#define GPIO_FUNC_32_USART1_TX      (GPIO_FUNC_32)      /*!< USART1 TX in Function Group 1 */
#define GPIO_FUNC_32_USART4_TX      (GPIO_FUNC_32)      /*!< USART4 TX in Function Group 2 */
#define GPIO_FUNC_32_USART3_TX      (GPIO_FUNC_32)      /*!< USART3 TX in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction33 GPIO Function 33 selection
 * @{
 */
#define GPIO_FUNC_33                (0x21U)
#define GPIO_FUNC_33_USART1_RX      (GPIO_FUNC_33)      /*!< USART1 RX in Function Group 1 */
#define GPIO_FUNC_33_USART4_RX      (GPIO_FUNC_33)      /*!< USART4 RX in Function Group 2 */
#define GPIO_FUNC_33_USART3_RX      (GPIO_FUNC_33)      /*!< USART3 RX in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction34 GPIO Function 34 selection
 * @{
 */
#define GPIO_FUNC_34                (0x22U)
#define GPIO_FUNC_34_USART2_TX      (GPIO_FUNC_34)      /*!< USART2 TX in Function Group 1 */
#define GPIO_FUNC_34_USART5_TX      (GPIO_FUNC_34)      /*!< USART5 TX in Function Group 2 */
#define GPIO_FUNC_34_USART8_TX      (GPIO_FUNC_34)      /*!< USART8 TX in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction35 GPIO Function 35 selection
 * @{
 */
#define GPIO_FUNC_35                (0x23U)
#define GPIO_FUNC_35_USART2_RX      (GPIO_FUNC_35)      /*!< USART2 RX in Function Group 1 */
#define GPIO_FUNC_35_USART5_RX      (GPIO_FUNC_35)      /*!< USART5 RX in Function Group 2 */
#define GPIO_FUNC_35_USART8_RX      (GPIO_FUNC_35)      /*!< USART8 RX in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction36 GPIO Function 36 selection
 * @{
 */
#define GPIO_FUNC_36                (0x24U)
#define GPIO_FUNC_36_USART3_TX      (GPIO_FUNC_36)      /*!< USART3 TX in Function Group 1 */
#define GPIO_FUNC_36_USART6_TX      (GPIO_FUNC_36)      /*!< USART6 TX in Function Group 2 */
#define GPIO_FUNC_36_USART9_TX      (GPIO_FUNC_36)      /*!< USART9 TX in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction37 GPIO Function 37 selection
 * @{
 */
#define GPIO_FUNC_37                (0x25U)
#define GPIO_FUNC_37_USART3_RX      (GPIO_FUNC_37)      /*!< USART3 RX in Function Group 1 */
#define GPIO_FUNC_37_USART6_RX      (GPIO_FUNC_37)      /*!< USART6 RX in Function Group 2 */
#define GPIO_FUNC_37_USART9_RX      (GPIO_FUNC_37)      /*!< USART9 RX in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction38 GPIO Function 38 selection
 * @{
 */
#define GPIO_FUNC_38                (0x26U)
#define GPIO_FUNC_38_USART4_TX      (GPIO_FUNC_38)      /*!< USART4 TX in Function Group 1 */
#define GPIO_FUNC_38_USART7_TX      (GPIO_FUNC_38)      /*!< USART7 TX in Function Group 2 */
#define GPIO_FUNC_38_USART10_TX     (GPIO_FUNC_38)      /*!< USART10 TX in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction39 GPIO Function 39 selection
 * @{
 */
#define GPIO_FUNC_39                (0x27U)
#define GPIO_FUNC_39_USART4_RX      (GPIO_FUNC_39)      /*!< USART4 RX in Function Group 1 */
#define GPIO_FUNC_39_USART7_RX      (GPIO_FUNC_39)      /*!< USART7 RX in Function Group 2 */
#define GPIO_FUNC_39_USART10_RX     (GPIO_FUNC_39)      /*!< USART10 RX in Function Group 3 */
/**
 * @}
 */

