RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_gpio.h
/** @defgroup GPIO_PinFunction40 GPIO Function 40 selection
 * @{
 */
#define GPIO_FUNC_40                (0x28U)
#define GPIO_FUNC_40_SPI1_SCK       (GPIO_FUNC_40)      /*!< SPI1 SCK in Function Group 1 & 3 */
#define GPIO_FUNC_40_SPI4_SCK       (GPIO_FUNC_40)      /*!< SPI4 SCK in Function Group 2 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction41 GPIO Function 41 selection
 * @{
 */
#define GPIO_FUNC_41                (0x29U)
#define GPIO_FUNC_41_SPI1_MOSI      (GPIO_FUNC_41)      /*!< SPI1 MOSI in Function Group 1 & 3 */
#define GPIO_FUNC_41_SPI4_MOSI      (GPIO_FUNC_41)      /*!< SPI4 MOSI in Function Group 2 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction42 GPIO Function 42 selection
 * @{
 */
#define GPIO_FUNC_42                (0x2AU)
#define GPIO_FUNC_42_SPI1_MISO      (GPIO_FUNC_42)      /*!< SPI1 MISO in Function Group 1 & 3 */
#define GPIO_FUNC_42_SPI4_MISO      (GPIO_FUNC_42)      /*!< SPI4 MISO in Function Group 2 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction43 GPIO Function 43 selection
 * @{
 */
#define GPIO_FUNC_43                (0x2BU)
#define GPIO_FUNC_43_SPI2_SCK       (GPIO_FUNC_43)      /*!< SPI2 SCK in Function Group 1 */
#define GPIO_FUNC_43_SPI5_SCK       (GPIO_FUNC_43)      /*!< SPI5 SCK in Function Group 2 */
#define GPIO_FUNC_43_SPI4_SCK       (GPIO_FUNC_43)      /*!< SPI4 SCK in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction44 GPIO Function 44 selection
 * @{
 */
#define GPIO_FUNC_44                (0x2CU)
#define GPIO_FUNC_44_SPI2_MOSI      (GPIO_FUNC_44)      /*!< SPI2 MOSI in Function Group 1 */
#define GPIO_FUNC_44_SPI5_MOSI      (GPIO_FUNC_44)      /*!< SPI5 MOSI in Function Group 2 */
#define GPIO_FUNC_44_SPI4_MOSI      (GPIO_FUNC_44)      /*!< SPI4 MOSI in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction45 GPIO Function 45 selection
 * @{
 */
#define GPIO_FUNC_45                (0x2DU)
#define GPIO_FUNC_45_SPI2_MISO      (GPIO_FUNC_45)      /*!< SPI2 MISO in Function Group 1 */
#define GPIO_FUNC_45_SPI5_MISO      (GPIO_FUNC_45)      /*!< SPI5 MISO in Function Group 2 */
#define GPIO_FUNC_45_SPI4_MISO      (GPIO_FUNC_45)      /*!< SPI4 MISO in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction46 GPIO Function 46 selection
 * @{
 */
#define GPIO_FUNC_46                (0x2EU)
#define GPIO_FUNC_46_SPI3_SCK       (GPIO_FUNC_46)      /*!< SPI3 SCK in Function Group 1 */
#define GPIO_FUNC_46_SPI6_SCK       (GPIO_FUNC_46)      /*!< SPI6 SCK in Function Group 2 */
#define GPIO_FUNC_46_SPI4_NSS0      (GPIO_FUNC_46)      /*!< SPI4 NSS0 in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction47 GPIO Function 47 selection
 * @{
 */
#define GPIO_FUNC_47                (0x2FU)
#define GPIO_FUNC_47_SPI3_MOSI      (GPIO_FUNC_47)      /*!< SPI3 MOSI in Function Group 1 */
#define GPIO_FUNC_47_SPI6_MOSI      (GPIO_FUNC_47)      /*!< SPI6 MOSI in Function Group 2 */
#define GPIO_FUNC_47_SPI1_NSS0      (GPIO_FUNC_47)      /*!< SPI4 NSS0 in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction48 GPIO Function 48 selection
 * @{
 */
#define GPIO_FUNC_48                (0x30U)
#define GPIO_FUNC_48_SPI3_MISO      (GPIO_FUNC_48)      /*!< SPI3 MISO in Function Group 1 */
#define GPIO_FUNC_48_SPI6_MISO      (GPIO_FUNC_48)      /*!< SPI6 MISO in Function Group 2 */
#define GPIO_FUNC_48_I2C1_SDA       (GPIO_FUNC_48)      /*!< I2C1 SDA in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction49 GPIO Function 49 selection
 * @{
 */
#define GPIO_FUNC_49                (0x31U)
#define GPIO_FUNC_49_SPI3_NSS0      (GPIO_FUNC_49)      /*!< SPI3 NSS0 in Function Group 1 */
#define GPIO_FUNC_49_SPI6_NSS0      (GPIO_FUNC_49)      /*!< SPI6 NSS0 in Function Group 2 */
#define GPIO_FUNC_49_I2C1_SCL       (GPIO_FUNC_49)      /*!< I2C1 SCL in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction50 GPIO Function 50 selection
 * @{
 */
#define GPIO_FUNC_50                (0x32U)
#define GPIO_FUNC_50_I2C1_SDA       (GPIO_FUNC_50)      /*!< I2C1 SDA in Function Group 1 */
#define GPIO_FUNC_50_I2C2_SDA       (GPIO_FUNC_50)      /*!< I2C2 SDA in Function Group 2 & 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction51 GPIO Function 51 selection
 * @{
 */
#define GPIO_FUNC_51                (0x33U)
#define GPIO_FUNC_51_I2C1_SCL       (GPIO_FUNC_51)      /*!< I2C1 SCL in Function Group 1 */
#define GPIO_FUNC_51_I2C2_SCL       (GPIO_FUNC_51)      /*!< I2C2 SCL in Function Group 2 & 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction52 GPIO Function 52 selection
 * @{
 */
#define GPIO_FUNC_52                (0x34U)
#define GPIO_FUNC_52_I2C3_SDA       (GPIO_FUNC_52)      /*!< I2C3 SDA in Function Group 1 */
#define GPIO_FUNC_52_I2C4_SDA       (GPIO_FUNC_52)      /*!< I2C4 SDA in Function Group 2 */
#define GPIO_FUNC_52_I2C6_SDA       (GPIO_FUNC_52)      /*!< I2C6 SDA in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction53 GPIO Function 53 selection
 * @{
 */
#define GPIO_FUNC_53                (0x35U)
#define GPIO_FUNC_53_I2C3_SCL       (GPIO_FUNC_53)      /*!< I2C3 SCL in Function Group 1 */
#define GPIO_FUNC_53_I2C4_SCL       (GPIO_FUNC_53)      /*!< I2C4 SCL in Function Group 2 */
#define GPIO_FUNC_53_I2C6_SCL       (GPIO_FUNC_53)      /*!< I2C6 SCL in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction54 GPIO Function 54 selection
 * @{
 */
#define GPIO_FUNC_54                (0x36U)
#define GPIO_FUNC_54_I2S1_CK        (GPIO_FUNC_54)      /*!< I2S1 CK in Function Group 1&3 */
#define GPIO_FUNC_54_I2C5_SDA       (GPIO_FUNC_54)      /*!< I2C5 SDA in Function Group 2 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction55 GPIO Function 55 selection
 * @{
 */
#define GPIO_FUNC_55                (0x37U)
#define GPIO_FUNC_55_I2S1_WS        (GPIO_FUNC_55)      /*!< I2S1_WS in Function Group 1&3 */
#define GPIO_FUNC_55_I2C5_SCL       (GPIO_FUNC_55)      /*!< I2C5_SCL in Function Group 2 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction56 GPIO Function 56 selection
 * @{
 */
#define GPIO_FUNC_56                (0x38U)
#define GPIO_FUNC_56_I2S1_SD        (GPIO_FUNC_56)      /*!< I2S1 SD in Function Group 1&3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction57 GPIO Function 57 selection
 * @{
 */
#define GPIO_FUNC_57                (0x39U)
#define GPIO_FUNC_57_I2S2_CK        (GPIO_FUNC_57)      /*!< I2S2 CK in Function Group 1 */
#define GPIO_FUNC_57_I2S3_CK        (GPIO_FUNC_57)      /*!< I2S3 CK in Function Group 2 */
#define GPIO_FUNC_57_I2S4_CK        (GPIO_FUNC_57)      /*!< I2S4 CK in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction58 GPIO Function 58 selection
 * @{
 */
#define GPIO_FUNC_58                (0x3AU)
#define GPIO_FUNC_58_I2S2_WS        (GPIO_FUNC_58)      /*!< I2S2 WS in Function Group 1 */
#define GPIO_FUNC_58_I2S3_WS        (GPIO_FUNC_58)      /*!< I2S3 WS in Function Group 2 */
#define GPIO_FUNC_58_I2S4_WS        (GPIO_FUNC_58)      /*!< I2S4 WS in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction59 GPIO Function 59 selection
 * @{
 */
#define GPIO_FUNC_59                (0x3BU)
#define GPIO_FUNC_59_I2S2_SD        (GPIO_FUNC_59)      /*!< I2S2 SD in Function Group 1 */
#define GPIO_FUNC_59_I2S3_SD        (GPIO_FUNC_59)      /*!< I2S3 SD in Function Group 2 */
#define GPIO_FUNC_59_I2S4_SD        (GPIO_FUNC_59)      /*!< I2S4 SD in Function Group 3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction60 GPIO Function 60 selection
 * @{
 */
#define GPIO_FUNC_60                (0x3CU)
#define GPIO_FUNC_60_CAN1_TX        (GPIO_FUNC_60)      /*!< CAN1 TX in Function Group 1~3 */
/**
 * @}
 */

/** @defgroup GPIO_PinFunction61 GPIO Function 61 selection
 * @{
 */
#define GPIO_FUNC_61                (0x3DU)
#define GPIO_FUNC_61_CAN1_RX        (GPIO_FUNC_61)      /*!< CAN1 RX in Function Group 1~3 */
/**
 * @}
 */

